import { createStore } from 'vuex'

const store = createStore({
	state: {
		cards: [
			{
				title: 'Наименование товара',
				subtitle: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
				price: '10 000',
				imgUrl: 'item-card.png'
			},
			{
				title: 'Наименование товара',
				subtitle: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
				price: '10 000',
				imgUrl: 'item-card.png'
			},
			{
				title: 'Наименование товара',
				subtitle: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
				price: '10 000',
				imgUrl: 'item-card.png'
			},
			{
				title: 'Наименование товара',
				subtitle: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
				price: '10 000',
				imgUrl: 'item-card.png'
			},
			{
				title: 'Наименование товара',
				subtitle: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
				price: '10 000',
				imgUrl: 'item-card.png'
			},
			{
				title: 'Наименование товара',
				subtitle: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
				price: '10 000',
				imgUrl: 'item-card.png'
			},
			{
				title: 'Наименование товара',
				subtitle: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
				price: '10 000',
				imgUrl: 'item-card.png'
			},
			{
				title: 'Наименование товара',
				subtitle: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
				price: '10 000',
				imgUrl: 'item-card.png'
			},
			{
				title: 'Наименование товара',
				subtitle: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
				price: '10 000',
				imgUrl: 'item-card.png'
			},
		],
	},
	mutations: {},
	getters: {},
	actions: {},
	modules: {},
})

export default store